const constant = {
  kinds: [{
    "code": "",
    "name": "单位种类"
  }, {
      "code": "length",
      "name": "长度"
    }, {
      "code": "weight",
      "name": "重量"
    }, {
      "code": "time",
      "name": "时间"
    }, {
      "code": "temperature",
      "name": "温度"
    }, {
      "code": "density",
      "name": "体积"
    }, {
      "code": "speed",
      "name": "速度"
    }, {
      "code": "area",
      "name": "面积"
    }, {
      "code": "speed",
      "name": "速度"
    }, {
      "code": "data",
      "name": "存储"
    }, {
      "code": "heat",
      "name": "热量"
    }, {
      "code": "power",
      "name": "功率"
    },
    {
      "code": "angle",
      "name": "角度"
    },
    {
      "code": "light",
      "name": "亮度"
    },
    {
      "code": "volume",
      "name": "容积"
    }, {
      "code": "press",
      "name": "压力"
    }
  ],

  unitCodes: {
    "area": ["平方千米", "平方米", "平方分米", "平方厘米", "平方毫米", "公顷", "公亩", "顷", "英亩", "亩", "平方英寸", "平方英尺", "平方码", "平方竿", "平方尺", "平方英里", "平方寸"],
    "heat": ["千卡", "卡", "克卡", "焦", "英热单位", "尔格", "公斤/米", "米制马力/时", "千瓦/时", "英尺/磅", "英制马力/时"],
    "density": ["磅/立方英寸", "磅/(石油)桶", "磅/立方英尺", "克/立方厘米", "千克/立方厘米", "千克/立方米", "克/立方米", "磅/美加仑", "磅/英加仑"],
    "data": ["比特", "字节", "拍字节", "千字节", "千兆字节", "艾字节", "兆字节", "太字节"],
    "length": ["千米", "米", "分米", "厘米", "毫米", "微米", "纳米", "光年", "码", "埃", "弗隆", "分","丈", "毫", "英里", "里", "英寸", "寸", "厘", "海里", "天文单位", "英尺",  "尺", "英寻"],
    "weight": ["千克", "吨", "克", "毫克", "斤", "两", "英担", "盎司", "格令", "担", "磅", "钱", "打兰", "英石", "公担", "克拉", "短吨", "微克", "美担", "长吨", "金衡盎司", "金衡格令", "金衡磅", "金衡担" ],
    "speed": ["米/秒", "英寸/秒", "海里/时", "英里/时", "千米/时", "光速", "马赫", "英尺/秒", "千米/秒"],
    "volume": ["美制干量蒲式耳", "英制桶", "升", "调羹", "美制液量品脱", "美制干量配克", "分升", "公石", "美制烹调杯", "英制加仑", "美制烹调汤勺", "液量打兰", "美制液量桶", "量滴", "美制干量夸脱", "汤勺", "美制干量桶", "英制蒲式耳", "及耳", "美制液量加仑", "厘升", "亩英尺", "立方英尺", "美制烹调调羹", "立方毫米", "立方英寸", "立方码", "十升", "美制液量夸脱", "英制品脱", "毫升", "美制干量品脱", "美制液量盎司", "立方米", "英制液量盎司"],
    "light": ["勒", "流明/平方厘米", "流明/平方米", "流明/平方英尺", "厘米烛光", "流明/平方英寸", "瓦/平方厘米", "英尺烛光"],
    "temperature": ["华氏度", "开尔文", "兰氏度", "摄氏度", "列氏度"],
    "angle": ["直角", "秒", "弧度", "度", "分", "圆周", "百分度", "毫弧度"],
    "force": ["美制吨力", "千克力", "千牛", "达因", "磅达", "米制吨力", "磅力", "克力", "牛", "英制吨力", "千磅力"],
    "power": ["焦耳/秒", "千卡/秒", "瓦", "毫瓦", "英热单位/秒", "英尺 磅/秒", "千瓦", "英制马力", "兆瓦", "米制马力", "牛顿 米/秒", "公斤 米/秒"],
    "time": ["年", "周", "天", "时", "分", "秒", "飞秒", "毫秒", "纳秒", "微秒", "皮秒"],
    "press": ["磅力/平方英寸", "毫巴", "兆帕", "公斤力/平方米", "标准大气压", "英寸水柱", "毫米水柱", "公斤力/平方厘米", "磅力/平方英尺", "巴", "毫米汞柱", "帕", "英寸汞柱", "千帕", "百帕"]
  }

}
export {
  constant
}